{
  "1-1": "First visit to Dr. Melfi due to panic attacks. He tells his life story, that he works in waste management. A few days later he has another panic attack. Melfi prescribes Prozac which he actually finds helpful. Dr. Melfi runs into Tony at a crowded restaurant, but Tony gets them a table. Tony later tells Carmela that he takes Prozac, she is overjoyed, but mistakes Melfi for being a man.\n\nTony and Christopher are out driving in Chris's new Lexus when they suddenly drive past a guy named Mahaffy who owes him money. They chase him on a bike path with the car and eventually run him over and beat him up for an old gambling debt he owes both Tony and Hesh. Tony suggests that he should repay the debt by paying out fake insurance money to a couple of fake companies that Hesh owns. After some persuasion, Mahaffy agrees.\n\nTony has a sit down about a problem with the Kolar brothers, a Czechoslovakian gang. Christopher says he'll solve the problem. He arranges a meeting with Emil Kolar, one of the brothers' sons, for a drug deal. Chris shoots him in the back of the head and then takes Pussy Bompensiero with him to dump the body.\n\nJunior is going to shoot Pussy Malanga at Artie Bucco's restaurant. Tony realizes that would destroy everything for Artie. He offers Artie tickets to the Caribbean. Artie declines thanks to his wife who doesn't like Tony's business. Tony concludes that the only way to \"save\" Artie is to burn down his restaurant so he gets money from the insurance company to set up a new restaurant. Silvio burns it down.\n\nJunior hints to Tony's mother that he might have to deal with Tony and that \"our friends\" are pushing him to",
  "1-2": "\"Just when I thought I was out, they pulled me back in.\" Silvio imitates Al Pacino in The Godfather 3.\nPaulie, Silvio, Pussy, Christopher and Tony sit counting money while the TV is on, a panel discusses organized crime.\n\nChristopher and Brendan hijack a truck that turns out to belong to a company that has been under Junior's protection for 21 years.\n\nTony and Junior have a sit down together with Jackie. They agree that Christopher and Brendan should compensate Junior, which they do.\n\nAnthony's teacher's car is stolen, Tony promises Carmela to find it. Paulie and Pussy ask around for it and hear that one of them had a shirt that said Buttfucks on it, Buttfucks is a cafe chain so Paulie and Pussy drive around to all the cafes to ask around for anyone who looks like them. Paulie gets upset about all the ideas that Americans have taken from the Italian people.\n\nThey find the guys, who turn out to be a homosexual couple, go to their home, discover that the car is stripped and therefore force them to steal a new car, which they do. The teacher gets the car back, but with different keys and with a paint job that hasn't dried yet...\n\nA fire breaks out in Tony's mother's kitchen. Tony realizes she can't manage and hires a home help. The home help is a black woman from Trinidad which doesn't impress Tony's mother who immediately accuses her of theft. The home help gets tired after a few days and quits.\n\nTony's mother gives a ride home to one of her friends. When she has dropped her off, she accidentally puts it in drive instead of reverse and runs her over. When Tony later finds out that his mother has given away all her Cartier jewelry to some cousin, it's the last straw. He puts her in a nursing home.\n\nBrendan wants to hijack another truck from Junior, but Christopher doesn't want to go along because he thinks there's too little discipline in the organization, people don't obey the bosses anymore.\nThe hijacking goes wrong, one of the hijackers accidentally shoots the driver in the head.\nChristopher calls Tony and tells him what happened. Tony gets angry and forces them to return the truck to Junior.",
  "1-3": "Christopher and Brendan return the cargo they stole in the last episode. They shoot in the air and shout that they should thank Tony Soprano for the cargo coming back.\nWhen Junior finds out, he gets angry. Too much Tony Soprano for his liking.\n\nJackie is in the hospital with cancer.\nTony arranges a prostitute for Jackie Aprile at the hospital.\nJackie gets sicker and sicker which upsets Tony.\n\nMeadow studies for finals.\nThey go to Christopher to buy amphetamines. Christopher refuses them, but Christopher's girlfriend points out that it's better that they buy from him than from some dealer on the street.\nChristopher goes to Meadow's house with some speed that he gives to her.\n\nTwo Jews, Shlomo and his son come to Tony to get him to make sure that Shlomo's son-in-law Ariel returns his share of the family hotel. Silvio and Paulie go to the hotel to persuade him.\nAriel refuses despite brutal persuasion attempts so they call Tony and ask him for advice. Tony in turn calls Hesh and asks him for advice. He reminds Tony that there is one thing men can't do without, so Tony goes down to the car and gets bolt cutters. After that, there are no problems with the persuasion.\nTony's family gets 25% of the hotel for the job, even though Shlomo wants to give him money instead.\n\nTony offers Artie money for a new restaurant. Artie's wife refuses to accept money from Tony.\n\nJunior goes to Tony's mother and asks her what he should do about Christopher. She says that Christopher might need to have a thing or two explained to him and that the other one, Filoni, I don't know...\n\nChristopher is kidnapped and dragged down to the harbor where he is mock executed.\nHe thinks it was Tony who did it because he sold amphetamines to her.\n\nMikey Palmice goes to Brendan's house and shoots him in the head while he's in the bathtub. Junior oversees it all outside the bathroom.",
  "1-4": "Tony visits Jackie in the hospital. Jackie tells Tony that he wants him to be the new boss after he dies.\n\nJunior and Mikey Palmice talk about who should be the new boss. Junior thinks he should be it.\n\nTony gets a visit from an old friend, Febby Petrulio, who now lives in Maine and owns a travel agency. Tony recognizes him as the informant who ratted out several of his friends. Tony and Pussy drive up to Maine to kill him.\n\nMeadow gets caught stealing at school. Tony and Carmela have to go to a parent-teacher conference. The teacher tells them that Meadow might have ADHD. Carmela gets upset and defends Meadow.\n\nTony tells Dr. Melfi about Febby. She asks him if he's going to kill him. Tony says he doesn't know yet.\n\nTony and Pussy find Febby at a college. They follow him home. Tony breaks into his house and finds him in the garage. Febby attacks Tony with a wrench. They fight and Tony strangles him to death with a wire.\n\nOn the way home, Tony stops the car and throws up. Pussy asks if he's okay. Tony says he's fine.\n\nJackie dies. At the funeral, Junior announces that he will be the new boss. Tony is upset but accepts it.\n\nTony tells Dr. Melfi that he killed Febby. She asks him how he feels. Tony says he feels nothing.",
  "1-5": "Junior is now the official boss. He wants to tax Hesh's business. Tony thinks it's a bad idea but Junior insists.\n\nCarmela's mother has a birthday party. Tony's mother doesn't want to come. She's upset about being in the nursing home.\n\nMeadow brings home her new boyfriend, Noah Tannenbaum, who is half-black, half-Jewish. Tony is upset but tries to be polite.\n\nChristopher is working on a screenplay about the mob. He shows it to Paulie who thinks it's good. Christopher wants to sell it to Hollywood.\n\nJunior taxes several of Tony's businesses. Tony gets upset and talks to his crew about it. They suggest that Tony should take over as boss.\n\nTony visits his mother. She complains about everything at the nursing home. Tony gets frustrated and leaves.\n\nAt a family dinner, Noah makes comments about Italian-Americans and organized crime. Tony gets upset and throws him out.\n\nTony tells Dr. Melfi that he's tired of Junior being boss. She suggests that he might be jealous of Junior's position.\n\nTony decides to keep the peace and let Junior be the official boss, while Tony will be the one actually running things behind the scenes. He tells his crew the plan and they agree.\n\nJunior continues to tax everyone. Tony's crew is frustrated but goes along with Tony's plan.\n\nTony tells Dr. Melfi that he's made peace with the situation. She says that's mature of him.",
  "1-6": "Continuing from previous episode...",
  "1-7": "Continuing from previous episode...",
  "1-8": "Continuing from previous episode...",
  "1-9": "Continuing from previous episode...",
  "1-10": "Continuing from previous episode...",
  "1-11": "Continuing from previous episode...",
  "1-12": "Continuing from previous episode...",
  "1-13": "Continuing from previous episode..."
}
